# ---------- CLI formulae ----------
brew "fish"
brew "starship"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "zoxide"
brew "lf"
brew "neovim"
brew "git"
brew "gh"                   # GitHub CLI
brew "bat"
brew "eza"                  # modern ls
brew "jq"
brew "yq"
brew "htop"
brew "fastfetch"            # modern neofetch alternative
brew "direnv"
brew "gum"
brew "tree"
brew "viu"
brew "exiftool"
brew "poppler"
brew "oven-sh/bun/bun"
brew "pulumi/tap/pulumi"
brew "azure-cli"

# ---------- GUI apps / casks ----------
cask "iterm2"
cask "visual-studio-code"
cask "jetbrains-toolbox"

# Browsers
cask "google-chrome"
cask "firefox"
cask "microsoft-edge"

# Keyboard / Utilities
cask "karabiner-elements"
cask "the-unarchiver"
cask "alt-tab"

# API/HTTP clients
cask "postman"
cask "hoppscotch"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Quick Look plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "suspicious-package"
cask "apparency"
cask "quicklookase"
cask "qlvideo"

# ---------- VS Code Extensions ----------
vscode "DaltonMenezes.aura-theme"
vscode "akamud.vscode-theme-onedark"
vscode "formulahendry.code-runner"
vscode "tamasfe.even-better-toml"
vscode "PKief.material-icon-theme"
vscode "foxundermoon.shell-format"
vscode "redhat.vscode-yaml"
