# ---------- CLI formulae ----------
brew "fish"
brew "starship"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "zoxide"
brew "lf"
brew "neovim"
brew "git"
brew "gh"               # GitHub CLI
brew "bat"
brew "eza"              # modern ls
brew "jq"
brew "yq"
brew "htop"
brew "fastfetch"        # modern neofetch alternative
brew "direnv"
brew "gum"
brew "tree"
brew "viu"
brew "exiftool"
brew "poppler"
brew "oven-sh/bun/bun"
