# Taps for formulae
tap "homebrew/cask"

# CLI formulae
brew "fish"
brew "starship"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "zoxide"
brew "lf"
brew "neovim"
brew "git"
brew "gh"
brew "bat"
brew "eza"
brew "jq"
brew "yq"
brew "htop"
brew "fastfetch"
brew "direnv"
brew "gum"
brew "tree"
brew "viu"
brew "exiftool"
brew "poppler"
brew "1password-cli"
